# Fixing Data representations


## Admin

- next assignment posted tonight.


### a4 TLDR:
- Review how your new dataset manipulation skills could have helped you in A2 or A3.
- clean provided (in the template) datasets
  - do tiny EDA to show complete;
  - add more EDA to get summarize and visualize
  - clean a specific dataset for access level 2 or python level 2 also; do both if you need all 3 achievments (prepare, access, python)
- Study some examples and notice patterns in data clearning

### Portfolio update

````{margin}
```{note}
The portfolio is open ended intentionally.  I want you to learn these skills a
little bit deeper than you have for the assignments, which is a little bit
deeper than we cover in class and show me that you learned.  I do *not* want you
to spend too much effort guessing what I want. I will look at what you submit
for evidence of learning and assess that.  There is not a single "right" answer.
```
````


- merge in your work from assignment 1
- portoflio will be due in ~2 weeks start planning
- read the [instructions](portfolioindex) and example [ideas](check1ideas); there will be time for q&a on Friday
- you can also create an outline and get feedback on your plan using an issue on your portflio repo


## Review Filtering

In [1]:
import pandas as pd

We can also filter using the `isin` method to compare each item in a column to a list

````{margin}
```{note}
You can see more about [groupby](groupby-detail) in notes from last week.
```
````

In [2]:
arabica_data_url = 'https://raw.githubusercontent.com/jldbc/coffee-quality-database/master/data/arabica_data_cleaned.csv'
# load the data
coffee_df = pd.read_csv(arabica_data_url)
# get total bags per country
bags_per_country_df = coffee_df.groupby('Country.of.Origin')['Number.of.Bags'].sum()

# sort descending, keep only the top 10 and pick out only the country names
top_bags_country_list = bags_per_country_df.sort_values(ascending=False)[:10].index

# filter the original data for only the countries in the top list
top_coffee_df = coffee_df[coffee_df['Country.of.Origin'].isin(top_bags_country_list)]

Yes this is a Series, not a data Frame, but a DataFrame is built of Series, so this is a small error in naming. `top_bags_country_list` is also an `Index` not a `list` but the names need to give an idea, not necessarily be precise so my choices are okay, but could be better.

In [3]:
type(coffee_df['Number.of.Bags'])

pandas.core.series.Series

In [4]:
type(coffee_df.loc[1])

pandas.core.series.Series

We can look at the final result

In [5]:
top_coffee_df.head()

,Unnamed: 0,Species,Owner,Country.of.Origin,Farm.Name,Lot.Number,Mill,ICO.Number,Company,Altitude,...,Color,Category.Two.Defects,Expiration,Certification.Body,Certification.Address,Certification.Contact,unit_of_measurement,altitude_low_meters,altitude_high_meters,altitude_mean_meters
0,1,Arabica,metad plc,Ethiopia,metad plc,NaN,metad plc,2014/2015,metad agricultural developmet plc,1950-2200,...,Green,0,"April 3rd, 2016",METAD Agricultural Development plc,309fcf77415a3661ae83e027f7e5f05dad786e44,19fef5a731de2db57d16da10287413f5f99bc2dd,m,1950.0,2200.0,2075.0
1,2,Arabica,metad plc,Ethiopia,metad plc,NaN,metad plc,2014/2015,metad agricultural developmet plc,1950-2200,...,Green,1,"April 3rd, 2016",METAD Agricultural Development plc,309fcf77415a3661ae83e027f7e5f05dad786e44,19fef5a731de2db57d16da10287413f5f99bc2dd,m,1950.0,2200.0,2075.0
2,3,Arabica,grounds for health admin,Guatemala,"san marcos barrancas ""san cristobal cuch",NaN,NaN,NaN,NaN,1600 - 1800 m,...,NaN,0,"May 31st, 2011",Specialty Coffee Association,36d0d00a3724338ba7937c52a378d085f2172daa,0878a7d4b9d35ddbf0fe2ce69a2062cceb45a660,m,1600.0,1800.0,1700.0
3,4,Arabica,yidnekachew dabessa,Ethiopia,yidnekachew dabessa coffee plantation,NaN,wolensu,NaN,yidnekachew debessa coffee plantation,1800-2200,...,Green,2,"March 25th, 2016",METAD Agricultural Development plc,309fcf77415a3661ae83e027f7e5f05dad786e44,19fef5a731de2db57d16da10287413f5f99bc2dd,m,1800.0,2200.0,2000.0
4,5,Arabica,metad plc,Ethiopia,metad plc,NaN,metad plc,2014/2015,metad agricultural developmet plc,1950-2200,...,Green,2,"April 3rd, 2016",METAD Agricultural Development plc,309fcf77415a3661ae83e027f7e5f05dad786e44,19fef5a731de2db57d16da10287413f5f99bc2dd,m,1950.0,2200.0,2075.0

In [6]:
top_coffee_df.shape, coffee_df.shape

((952, 44), (1311, 44))

## Fixing a Column

In tidy data each column is exactly one variable. Let's look at the `Bag.Weight`

In [7]:
coffee_df['Bag.Weight'].sample(10)

389       69 kg
517       70 kg
1176       1 kg
297       70 kg
1171      70 kg
313           1
930        1 kg
414     100 lbs
245       69 kg
1285       1 kg
Name: Bag.Weight, dtype: object

This is actually two pieces of information, the value measured and the units used.  In addition to the fact that there are multiple units, even if we could convert them, we cannot do math on these because they're strings. (notice it says "object" as the type)

Series have a `str` attribute so we can apply base python string methods to each value in a column.

In [8]:
coffee_df['Bag.Weight'].str

What we want is to split it

In [9]:
coffee_df['Bag.Weight'].str.split(' ').sample(10)

136     [70, kg]
960      [1, kg]
867      [1, kg]
693      [1, kg]
281     [60, kg]
43      [15, kg]
1205     [1, kg]
112     [60, kg]
608     [60, kg]
674      [2, kg]
Name: Bag.Weight, dtype: object

Since this looks good, we can save it to a variable.

In [10]:
split_bw = coffee_df['Bag.Weight'].str.split(' ')

We still have one problem, each element contains a list.

In [11]:
type(split_bw[0])

list

What we want is a `DataFrame` with two columns, one of the first value and one of the second value for each list.

A `DataFrame` is build of Series which are each row (and each column) the lists we have are each the content that we want to put in one Series and then stack them all together.  

To do this, we can cast each list to a `Series` using the `apply` method which automatically stacks Series or DataFrames back together after applying a function to each row (or column).

Recall that in python, we can use types as functions to cast

In [12]:
num = '2'

In [13]:
type(int(num))

int

In [14]:
type(num)

str

So, back to our real problem:

In [15]:
split_bw.apply(pd.Series)

       0    1
0     60   kg
1     60   kg
2      1  NaN
3     60   kg
4     60   kg
...   ..  ...
1306   1   kg
1307   2   kg
1308  69   kg
1309   1   kg
1310  69   kg

[1311 rows x 2 columns]

This looks good, but these columns are not very informative, so we can rename them.

Rename can take many different inputs and be applied on lots of parts, but we will use it with a dictionary that serves as a mapping (like the mathematical sense of mapping; like a function).  It will change the column with each key to the value.

In [16]:
split_df = split_bw.apply(pd.Series).rename(columns={0:'Weight',1:'Units'})
split_df

     Weight Units
0        60    kg
1        60    kg
2         1   NaN
3        60    kg
4        60    kg
...     ...   ...
1306      1    kg
1307      2    kg
1308     69    kg
1309      1    kg
1310     69    kg

[1311 rows x 2 columns]

This is good, but it's only the one column.  We can use concat to put them together.

In [17]:
pd.concat([coffee_df,split_df],axis=1).head(2)

,Unnamed: 0,Species,Owner,Country.of.Origin,Farm.Name,Lot.Number,Mill,ICO.Number,Company,Altitude,...,Expiration,Certification.Body,Certification.Address,Certification.Contact,unit_of_measurement,altitude_low_meters,altitude_high_meters,altitude_mean_meters,Weight,Units
0,1,Arabica,metad plc,Ethiopia,metad plc,NaN,metad plc,2014/2015,metad agricultural developmet plc,1950-2200,...,"April 3rd, 2016",METAD Agricultural Development plc,309fcf77415a3661ae83e027f7e5f05dad786e44,19fef5a731de2db57d16da10287413f5f99bc2dd,m,1950.0,2200.0,2075.0,60,kg
1,2,Arabica,metad plc,Ethiopia,metad plc,NaN,metad plc,2014/2015,metad agricultural developmet plc,1950-2200,...,"April 3rd, 2016",METAD Agricultural Development plc,309fcf77415a3661ae83e027f7e5f05dad786e44,19fef5a731de2db57d16da10287413f5f99bc2dd,m,1950.0,2200.0,2075.0,60,kg

Why `axis=1` again?  

Let's look at the other one.

In [18]:
bad_concat = pd.concat([coffee_df,split_df],axis=0)
bad_concat.shape

(2622, 46)

It has double the rows
```{important}
checking the shame is the first thing to do to see if you did the right one
```

and the bottom of it most columns are NaN (null, missing)

In [19]:
bad_concat.tail()

,Unnamed: 0,Species,Owner,Country.of.Origin,Farm.Name,Lot.Number,Mill,ICO.Number,Company,Altitude,...,Expiration,Certification.Body,Certification.Address,Certification.Contact,unit_of_measurement,altitude_low_meters,altitude_high_meters,altitude_mean_meters,Weight,Units
1306,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,kg
1307,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,kg
1308,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,69,kg
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,kg
1310,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,69,kg